{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js v3.9.0",
    "convertedBy": "TensorFlow.js Converter v3.9.0",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_1",
              "trainable": true,
              "batch_input_shape": [null, 6],
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_2",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_3",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}},
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_4",
              "trainable": true
            }
          }
        ]
      },
      "keras_version": "2.6.0",
      "backend": "tensorflow"
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {"name": "dense_1/kernel", "shape": [6, 64], "dtype": "float32"},
          {"name": "dense_1/bias", "shape": [64], "dtype": "float32"},
          {"name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32"},
          {"name": "dense_2/bias", "shape": [32], "dtype": "float32"},
          {"name": "dense_3/kernel", "shape": [32, 16], "dtype": "float32"},
          {"name": "dense_3/bias", "shape": [16], "dtype": "float32"},
          {"name": "dense_4/kernel", "shape": [16, 1], "dtype": "float32"},
          {"name": "dense_4/bias", "shape": [1], "dtype": "float32"}
        ]
      }
    ]
  }